app/views/pictures/new.html.erb

SELECT  "users".* FROM "users" LIMIT ?  [["LIMIT", 1]]
---
<%= f.label "Select Own User ID" %>
<p> <%= f.collection_select :user_id, User.all, :id, :name %> </p>