app/views/pictures/show.html.erb


<h2>Comments: <% @picture.comments.each do |c| %></h2>
<ul>
  <%= User.find(c.user_id).name %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."picture_id" = ?  [["picture_id", 3]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]