app/controllers/comments_controller.rb

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."picture_id" = ?  [["picture_id", 1]]
SELECT "pictures".* FROM "pictures" WHERE "pictures"."user_id" = ?  [["user_id", 21]]
---
  def show
    @comment = Comment.find(params[:id])
    @usercomments = User.first.pictures.all.map {|x| x.comments.all.map {|y| y.content}}

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]
SELECT "comments".* FROM "comments"
---
  def create
    session[:return_to] = request.referer
    @comment = Comment.new
    @comment.picture = Picture.first

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT ?  [["id", 24], ["LIMIT", 1]]
---
  def update
    @comment = Comment.new
    @comment.picture = Picture.first