app/controllers/comments_controller.rb

  def edit
    @comment = Comment.find(params[:id])
    @picture = Picture.find(params[:id])
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT ?  [["id", 23], ["LIMIT", 1]]