app/controllers/comments_controller.rb

  def update
    @comment = Comment.find(params[:id])
    #@comment.picture = Picture.first
    @comment.update({:content => comment_params[:content]})
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 34], ["LIMIT", 1]]
UPDATE "comments" SET "content" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["content", "test 2"], ["updated_at", "2019-03-28 14:13:26.265055"], ["id", 34]]