app/controllers/pictures_controller.rb

  def update
    # byebug
    @picture = Picture.find_by_id(params[:id])
    @picture.update(edit_picture_params)
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "pictures" SET "name" = ?, "attachment" = ? WHERE "pictures"."id" = ?  [["name", "kabdkjf"], ["attachment", "image/upload/v1553844369/uqt0pn6u6e4f6zpb5ozn.png"], ["id", 34]]