app/controllers/pictures_controller.rb

  def index
    @user = User.find(params[:user_id])
    @pictures = Picture.all
---
SELECT  "users".* FROM "users" WHERE (#<Picture::ActiveRecord_Relation:0x00007f9611e24a60>) LIMIT ?  [["LIMIT", 1]]
SELECT "pictures".* FROM "pictures"

  def create
    # raise
    @picture = Picture.new(picture_params)
    @picture.user_id = current_user.id
      if @picture.valid?
        @picture.save
---
INSERT INTO "pictures" ("name", "attachment", "user_id") VALUES (?, ?, ?)  [["name", "e;lkede"], ["attachment", "odkt9mr3fzxmv5ehnxct.jpg"], ["user_id", 1]]

  def destroy
     @picture = Picture.find(params[:id])
     @picture.destroy
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "pictures" WHERE "pictures"."id" = ?  [["id", 9]]