app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
      if @user.valid?
        @user.save
---
INSERT INTO "users" ("name", "password_digest", "email") VALUES (?, ?, ?)  [["name", "Sal"], ["password_digest", "$2a$10$hI08GYfkpQkcSqprS41KCeQGu/DLThxYYAwqxPBPSSz7vrMo7g0/u"], ["email", "sal@email.com"]]

  def update
    @user = User.find_by_id(params[:id])
    @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 42], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "password_digest" = ? WHERE "users"."id" = ?  [["name", "Manu"], ["password_digest", "$2a$10$ZWVCnLeC3fFDjtXCPzjeEuPCSkO1JVQzFx0tQ65zqKM/KwhQ/0oHa"], ["id", 42]]